/*Разработать приложение на основе UDP-соединения, позволяющее осуществлять
взаимодействие клиента и сервера по совместному решению задач обработки информации.
Приложение должно располагать возможностью передачи и модифицирования получаемых
(передаваемых) данных. Возможности клиента: передать серверу исходные параметры
(вводятся с клавиатуры) для расчета значения функции, а также получить расчетное
значение функции. Возможности сервера: по полученным от клиента исходным параметрам
рассчитать значение функции, передать клиенту расчетное значение функции, а также
сохранить исходные параметры и значение функции в файл.*/
