/*На базе приведенного выше примера разработать приложение, позволяющее осуществлять
взаимодействие клиента и сервера по совместному решению задач обработки информации
(смотреть варианты индивидуальных заданий). Протокол взаимодействия – TCP. Приложение
клиента должно иметь GUI-интерфейс, показанный на рис. 2.3. Приложение сервера можно
оставить в консольной реализации. Сервер должен предоставлять возможность последовательного
установления соединения с клиентами (как это реализовано в примере). */

/*Клиент посылает слово серверу, сервер возвращает назад в обратном порядке следования
букв это слово клиенту.*/